cases/Day-1/Part-1.3_Tutorial/squareChannelConv_robin_constantFlux_sol/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// Laminar viscosity of air
nu              15.16e-6; // Pa * s;

// Thermal expansion coefficient
beta            0;

// Reference temperature
TRef            273.5;

// Laminar Prandtl number
Pr              0.73;

// Turbulent Prandtl number
Prt             0.85;

// Additional parameters

// Thermal conductivity / W/m/K
k               0.02514;

// Convection coefficient / W / m^2 / K 
h               25;   

// Temperatura de los alrededores / K
T_inf           300;

// ************************************************************************* //